#+TITLE: COEXISTENCE
#+STARTUP: indent showall
*** DONE set up a Postgres DB.

#+BEGIN_SRC clojure
(def db {:dbtype "postgresql"
         :dbname "swallows"
         :host "localhost"
         :user "swallows"
         :password "swallows"})
#+END_SRC



add to project.clj dependencies:

#+BEGIN_SRC clojure
[org.clojure/java.jdbc "0.7.8"]
[org.postgresql/postgresql "42.2.5.jre7"]
[honeysql "0.9.4"]
#+END_SRC

#+RESULTS:
: class clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionclass clojure.lang.Compiler$CompilerExceptionCompilerException java.lang.ClassNotFoundException: org.clojure, compiling:(/home/adam/clojure-projects/swallows/src/swallows/views.clj:1:7898) 
: CompilerException java.lang.ClassNotFoundException: org.postgresql, compiling:(/home/adam/clojure-projects/swallows/src/swallows/views.clj:1:7898) 
: CompilerException java.lang.RuntimeException: Unable to resolve symbol: honeysql in this context, compiling:(/home/adam/clojure-projects/swallows/src/swallows/views.clj:1:7898) 

